{
  "user": {
    "name": "Piotr"
  },
  "recipes": [
    {
      "id": 1,
      "name": "Chicken broth",
      "description": "Chicken broth with noodles perfect for Sunday dinner",
      "steps": [
        "Bring to the boil slowly. Collect the foam. Peel the vegetables.",
        "Cut the onion in half. Fire it over the gas or burn it in a pan.",
        "Add vegetables, spices and two stock cubes to the stock. Simmer for about 3 hours.",
        "After cooking, let the broth stand for 20 minutes, then slowly pass it through a fine sieve or through gauze. The broth should be clear.",
        "Dice the cooked vegetables, chop the chicken meat into small pieces. Chop the parsley. Serve the broth with pre-cooked pasta, vegetables and meat, sprinkled with parsley. If necessary, season the broth with salt and pepper."
      ],
      "ingredients": [
        "Chicken (about 1 kg).",
        "Stock cube (2 pieces)",
        "Pasta (200g).",
        "Carrots (2 pieces).",
        "Onions (1 piece).",
        "Parsley root (1 piece).",
        "Parsley (1 bunch).",
        "Small celery (1 piece).",
        "Leek (1 piece).",
        "Spices (pepper and nutmeg)."
      ]
    },
    {
      "id": 2,
      "name": "Potato soup",
      "description": "Nutritious potato soup.",
      "steps": [
        "Peel the potatoes, celery and onion, dice the potatoes, cut the leek into slices, and chop the onion.",
        "Fry the vegetables in a pot, pour about 800 ml of water, add the stock cube. Boil the soup for about 20 minutes, until the potatoes are soft. Blend the soup in a blender cup, season with cream, season to taste with pepper and nutmeg.",
        "Dice the bread, chop the chives. Put the bread on a baking tray from the oven. Toast the croutons until golden brown in the oven preheated to 180 ° C.",
        "Serve the soup with croutons, sprinkled with chives."
      ],
      "ingredients": [
        "Potatoes (500 grams).",
        "Stock cube (2 pieces)",
        "Celery (1 piece)",
        "Leek, only the white part (1 piece)",
        "Onion (1 piece)",
        "Cream 18% (50 milliliters)",
        "White pepper (1 pinch)",
        "Chive",
        "Olive oil (3 tablespoons)",
        "Toasted bread (8 toasts)"
      ]
    },
    {
      "id": 3,
      "name": "Cabbage soup with bacon and sausage",
      "description": "Traditional cabbage soup for every occasion",
      "steps": [
        "Prepare the stock from the stock portion and broths.",
        "Add chopped potatoes, carrots and cook for 15 minutes.",
        "Season the soup with marjoram, cumin and pepper to taste.",
        "Dice the bacon and fry it in a pan. Add the shredded cabbage to it. Stew it for about 10 minutes on low heat, then add to the soup.",
        "Dice the onion and sauté it in butter. Then add the flour and roux prepared in this way to season the soup. Be careful that the butter does not burn, otherwise the dish will be unpalatable and unhealthy."
      ],
      "ingredients": [
        "broth portion (500 grams).",
        "Chicken broth (2 pieces).",
        "Smoked bacon (150 grams).",
        "Sauerkraut (300 grams).",
        "Carrots (2 pieces).",
        "Parsley (1 piece).",
        "Potatoes (200 grams).",
        "Medium size onion (2 pieces).",
        "Cumin (0.5 tablespoons).",
        "Marjoram (1 tbsp.).",
        "Black pepper (1 pinch).",
        "Wheat flour (2 tablespoons).",
        "Butter (50 grams)."
      ]
    },
    {
      "name": "Cauliflower and millet cutlets",
      "description": "Healthy cauliflower and millet cutlets",
      "steps": [
        "Boil the groats in 200 ml of water with the stock cube.",
        "Hard-boil 2 eggs, peel and chop.",
        "Dice the onion and fry it.",
        "Roast the pumpkin seeds in a dry frying pan.",
        "Chop raw cauliflower with a knife.",
        "Chop up a bunch of cilantro.",
        "In a bowl, combine warm groats, eggs, cauliflower.",
        "Form ma chops from the mass.",
        "Serve the chops with the garlic dip."
      ],
      "ingredients": [
        "Millet (100 grams).",
        "Milk (100 milliliters).",
        "Onions (1 piece).",
        "Coriander (1 bunch).",
        "Eggs (2 pieces).",
        "Cauliflower (1 piece)."
      ],
      "id": 4
    },
    {
      "name": "Stuffed minced cutlets with mushrooms and cheese",
      "description": "Stuffed minced pork and beef cutlets with mushrooms and cheese",
      "steps": [
        "Slice the mushrooms and fry them in a pan, then let them cool.",
        "Finely chop the chives and add to the mushrooms. Then add the grated cheese and mix again.",
        "Soak the roll in water or milk. When it is soft, squeeze it thoroughly.",
        "Combine the soaked bun with the minced meat, egg, meat seasoning and grated onion.",
        "Knead the mass thoroughly by hand. If it is too loose, add some breadcrumbs to it.",
        "Make pancakes out of the meat. Put a little stuffing in the middle of each and then wrap them in minced meat. Make chops this way.",
        "Sprinkle the fried chops with a few tablespoons of water and then cover the pan so that the chops come for a while. Serve the chops with the potatoes and salad."
      ],
      "ingredients": [
        "Minced pork and beef meat (500g).",
        "Egg (1 piece).",
        "Medium onion (1 piece).",
        "Breadcrumbs (2 pieces).",
        "Mushrooms (400g).",
        "Chives (1 bunch)."
      ],
      "id": 5
    },
    {
      "name": "Salmon baked in honey sauce",
      "description": "Delicious salmon baked in honey sauce",
      "steps": [
        "Mustard seeds from Canada and Black pepper from Vietnam Knorr, grind them into a pulp in a mortar, combine with honey, dill and vinegar.",
        "In the resulting sauce, coat the salmon fillets.",
        "Place them on a baking sheet lined with parchment paper. Put them in an oven preheated to 190 ° C for about 15 minutes."
      ],
      "ingredients": [
        "Salmon fillets (4 pieces of 150 grams).",
        "Honey (4 tablespoons).",
        "Mustard, black pepper.",
        "Chopped dill (half a bunch).",
        "Wine vinegar (2 tablespoons)."
      ],
      "id": 6
    },
    {
      "name": "Zander with stewed vegetables",
      "description": "Zander with stewed vegetables for those who do not like meat",
      "steps": [
        "Grate the carrots and celery on a coarse-mesh grater, cut the onions into slices.",
        "Fry all the vegetables in oil for about 7 minutes, then season with pepper and put them in a baking dish.",
        "Place the fish on top of the vegetables.",
        "Add cream.",
        "Fish and vegetables, then put the dish in the preheated oven and bake for 20 minutes at 200 degrees. Season to taste."
      ],
      "ingredients": [
        "Zander or other white fish (600 grams).",
        "Carrots (3 pieces).",
        "Root celery (1 piece).",
        "White onion (1 piece).",
        "Sweet Cream 18% (200 grams).",
        "Oil, black pepper."
      ],
      "id": 7
    },
    {
      "name": "Rice with vegetables and meat",
      "description": "Oriental and delicious",
      "steps": [
        "Cut the meat and paprika into small cubes and fry in a saucepan until golden brown. Add the onion, sliced ​​and chopped garlic.",
        "Pour in rice and fry for a few minutes, then add 1 liter of water.",
        "Enhance the taste of the dish by seasoning it with a stock cube. Stir and cook until the rice absorbs the liquid."
      ],
      "ingredients": [
        "Pork neck (250 grams).",
        "Rice (500 grams).",
        "Red pepper (1 piece).",
        "Green pepper (1 piece).",
        "Onion (1 piece).",
        "Garlic (1 clove).",
        "Oil (4 tablespoons).",
        "Stock cube (1 piece)."
      ],
      "id": 8
    },
    {
      "name": "Rice with vegetables",
      "description": "Oriental proposition for vegetarians",
      "steps": [
        "Boil the rice in water until it is loose. Then drain it.",
        "Dice the carrot, onion and garlic.",
        "Heat the oil in a frying pan and fry carrots, onions, garlic and green peas.",
        "After a while, add the rice and the drained canned chickpeas.",
        "Add curry.",
        "Fry it all intensely until most of the liquid has evaporated. Serve with freshly chopped coriander."
      ],
      "ingredients": [
        "Basmati Rice (400 grams).",
        "Onion (1 piece).",
        "Carrots (1 piece).",
        "Frozen peas (half a cup).",
        "Chickpeas (100 grams).",
        "Coriander (half a bunch).",
        "Curry spice."
      ],
      "id": 9
    },
    {
      "name": "Mexican chicken",
      "description": "Mexican spicy chicken",
      "steps": [
        "Chicken breasts and onion cut into cubes, fry them in a small amount of fat in a pot.",
        "Add red beans, corn and diced red pepper.",
        "Serve the finished dish with cooked rice."
      ],
      "ingredients": [
        "Chicken breasts (350 grams).",
        "Onions (2 pieces).",
        "Red beans (400 grams).",
        "Corn (400 grams).",
        "Red pepper (1 piece).",
        "Rice (100 grams)."
      ],
      "id": 10
    },
    {
      "name": "Risotto with chicken",
      "description": "Colorful chicken risotto",
      "steps": [
        "Finely chop the onion and fry it in a wide saucepan in hot olive oil and raw rice for 1 minute.",
        "Dice the chicken breast, sprinkle with chicken seasoning and fry in a pan.",
        "Pour 300 milliliters of water and one broth into the fried rice. Stew it for about 12 minutes.",
        "Then add the mix of vegetables, chicken, Provencal herbs and 250 milliliters of water and stew for another 6 minutes.",
        "At the end of stewing, add the grated cheese, cream and butter. Stir vigorously and set aside for a few minutes. Serve immediately."
      ],
      "ingredients": [
        "Chicken breast fillets (200 grams).",
        "Ready frozen mix of vegetables (400 grams).",
        "Bullion, chicken seasoning.",
        "White onion (1 piece).",
        "Arborio rice (200 grams).",
        "A mixture of herbs.",
        "Grated yellow cheese (150 grams).",
        "Sour cream (4 tablespoons).",
        "Olive (1 tbsp.).",
        "Butter (50 grams)."
      ],
      "id": 11
    },
    {
      "name": "Risotto with chicken and mushrooms",
      "description": "Risotto with chicken and mushrooms",
      "steps": [
        "Boil the broth with 1 liter of water to make a bouillon.",
        "Heat half of the oil in a frying pan and fry the meat in strips. Then add the mushrooms.",
        "Take the meat and mushrooms out of the pan and add the remaining oil to it. Fry the diced shallots and garlic.",
        "Add the rice and fry it for a few minutes. Then pour the decoction of dried mushrooms, cut them into strips and also add to the risotto.",
        "After a while, pour in enough broth to cover the rice. Cook slowly until the grains absorb the liquid, then add another portion. Repeat until the rice is soft.",
        "Finally, add the meat and mushrooms back. Cook for 2 minutes. Pour the cream into the rice, add the butter and grated cheese.",
        "Boil it all for 2-3 minutes and season with freshly ground pepper and chopped parsley.",
        "Serve the risotto immediately in a deep plate. It should be liquid."
      ],
      "ingredients": [
        "Arborio rice (200 grams).",
        "Chicken breast (2 pieces).",
        "Poultry broth.",
        "Dried mushrooms (4 pieces).",
        "Mushrooms (200 grams).",
        "Shallot onion (2 pieces).",
        "Garlic (2 cloves).",
        "Butter (2 tablespoons).",
        "Sour cream (half a glass).",
        "Parsley (half a bunch).",
        "Parmesan (80 grams).",
        "Olive (100 ml)."
      ],
      "id": 12
    },
    {
      "name": "Chicken rolls with spinach",
      "description": "Chicken rolls with spinach",
      "steps": [
        "Cut the onion into small cubes and fry it in a pan with the pine nuts. Add the spinach and fry it for a while, stirring occasionally.",
        "Season the spinach with feta cheese, hot pepper, nutmeg and dried tomatoes.",
        "Wash chicken breasts, remove membranes and grease and dry. Then place them on foil smeared with olive oil, cover with plastic wrap and smash thoroughly.",
        "Season the surface of the chicken to taste with a little Knorr Chicken Seasoning, then put a layer of spinach on it.",
        "Roll the breast and wrap in aluminum foil. Twist the ends of the foil to make a shaped bar.",
        "Place the breasts in an oven preheated to 200 ° C for 20-30 minutes.",
        "Unwrap the baked breasts from the foil - collect the resulting juice and pour it into a container. Fill up the collected liquid with water up to 300 milliliters.",
        "Cook for about 3 minutes. Serve the rolls with the rice, generously drizzled with the cheese sauce."
      ],
      "ingredients": [
        "Chicken breast (400 grams).",
        "Fresh spinach (800 grams).",
        "Small onion (1 piece).",
        "Feta cheese (20 grams).",
        "Chicken spice.",
        "Pine nuts (20 grams).",
        "Hot pepper.",
        "Nutmeg.",
        "Salt.",
        "Olive oil (20 ml)."
      ],
      "id": 13
    },
    {
      "name": "Bolognese roladki",
      "description": "Bolognese roladki",
      "steps": [
        "In a frying pan on hot fat, fry chopped garlic, onion and chili pepper, add spinach and fry for a while.",
        "Add cream and crushed cashews. If necessary, season to taste and set aside to cool.",
        "Place the chicken breasts on the foil, cover with the second layer of foil and, gently tapping the pestle, break the meat into a thin slice.",
        "Put a portion of spinach on the meat. Gently roll the edges of the meat inwards and roll it up, securing the rolls with toothpicks to prevent them from rolling out.",
        "Fry the rolls on both sides in hot fat, put them to the side, pour canned tomatoes and ¼ cup of water into the same pan.",
        "Mix everything thoroughly and bring to a boil. Put the rolls back into the sauce and stew, covered, for about 15 minutes until the meat is inside."
      ],
      "ingredients": [
        "Chicken breast (3 pieces).",
        "Spinach thawed, pressed from the juice (450 grams)",
        "Bolognese sauce spice.",
        "Mozzarella (100 grams).",
        "Pelatti tomatoes (250 grams).",
        "Chilli (1 piece).",
        "Onions (1 piece).",
        "Sun-dried tomatoes (50 grams).",
        "Nutmeg.",
        "Garlic cloves (2 pieces).",
        "Cashews (100 grams).",
        "Cream 18% (100 milliliters).",
        "Margarine (3 tablespoons)."
      ],
      "id": 14
    },
    {
      "name": "Roasted pork neck",
      "description": "Roasted pork neck with a crispy crust",
      "steps": [
        "Rub the pork neck with the meat spice and leave it in a cool place for a while, so that the spice penetrates the meat better.",
        "Fry the meat on both sides, place it in an ovenproof dish.",
        "Cut the toasted bread into small cubes, mix with mayonnaise, mustard and chopped parsley.",
        "Put the resulting roll on top of the meat. Bake it for 1 hour at about 180 * C."
      ],
      "ingredients": [
        "Pork neck (600 grams).",
        "Toasted bread.",
        "Mayonnaise (100 grams).",
        "Parsley (1 bunch).",
        "Spices.",
        "Mustard (2 tablespoons)."
      ],
      "id": 15
    },
    {
      "name": "Mexican Gołąbki",
      "description": "Mexican spicy stuffed cabbage rolls",
      "steps": [
        "Combine the meat with the roll. Cut the pepper and one onion into 3-4 cm long strips and fry in oil. Dice the other onion finely.",
        "Combine the meat with the egg, finely chopped onion and spices. Season to taste and make a homogeneous mass.",
        "Prepare small portions of the meat. Put the fried paprika and onion on each of them, and then close the whole and form cabbage rolls.",
        "Roll the cabbage rolls in flour and fry them in a pan. Add the tomato paste to the pan, add 400 ml of water and add the gravy, bring it to a boil.",
        "Cover the pan and simmer the roulades for another 10 minutes over low heat. At the end, add the cream to the sauce. Serve the finished roulades with rice."
      ],
      "ingredients": [
        "Minced pork and beef meat (500 grams).",
        "A roll soaked in milk (1 piece).",
        "Barbecue sauce.",
        "Red pepper (3 pieces).",
        "Onions (2 pieces).",
        "Egg (1 piece).",
        "Tomato paste (1 tablespoon).",
        "Sour cream (1 tablespoon).",
        "Sweet pepper, ground coriander."
      ],
      "id": 16
    },
    {
      "name": "Beefsteak with vegetables",
      "description": "Beefsteak with vegetables",
      "steps": [
        "Cut the tenderloin into slices about 3 cm thick and cut to form a pocket. Sprinkle with pepper.",
        "Cut the zucchini and eggplant lengthwise into 4 parts and remove the seeds, then cut them into slices. Dice the onion and pepper.",
        "Fry the vegetables in a frying pan, adding 1 tablespoon of oregano and a pinch of pepper. Cook until semi-hard.",
        "Wash the potatoes, do not peel, cut into moons. Add paprika, 1 tablespoon of oregano, drizzle with oil. Bake in the oven preheated to 180 ° C for about 20 minutes.",
        "Stuff the steaks with vegetables. Fry in well-heated fat for about 6 minutes on each side.",
        "Pour the gravy into the water and bring to a boil, add the parsley. Pour the sauce over the beefsteak and serve with baked potatoes sprinkled with chopped parsley."
      ],
      "ingredients": [
        "Beef tenderloin (500 grams).",
        "Barbecue sauce.",
        "Zucchini (1 piece).",
        "Eggplant (1 piece).",
        "Onions (1 piece).",
        "Red pepper (1 piece).",
        "Potatoes (500 grams).",
        "Spices (hot pepper, black pepper, oregano).",
        "Parsley (10 grams).",
        "Oil (150 milliliters)."
      ],
      "id": 17
    },
    {
      "name": "Roast beef with sauce",
      "description": "Juicy roast beef with mustard-herb sauce",
      "steps": [
        "Create a flavorful marinade by rubbing the stock cubes in a bowl with olive oil. Add the mustard and chopped rosemary.",
        "Wash the meat and dry with a paper towel. Brush with the prepared paste. Sprinkle with pepper.",
        "Fry the marinated meat in a pan on each side and then put it into a roasting pan.",
        "Put the dish in the oven preheated to 220 degrees C, bake the meat for about 12-15 minutes.",
        "After this time, reduce the temperature to 170 ° C and bake for 5-10 minutes more, depending on how well done you like the meat.",
        "Allow the meat to rest for 10 minutes before serving. Then, slice the meat and serve, preferably with roast or herb sauce."
      ],
      "ingredients": [
        "Beef, e.g. roast beef (1.5 kilograms).",
        "Stock cube (2 pieces).",
        "Fresh rosemary (1 sprig).",
        "Dijon mustard (2 tablespoons).",
        "Olive oil (3 tablespoons).",
        "Black pepper."
      ],
      "id": 18
    },
    {
      "name": "Pork loin with blueberries",
      "description": "Meat with a sweet twist",
      "steps": [
        "Rub the chops thoroughly with oil, marjoram, mustard and leave them in the fridge for at least an hour.",
        "Boil the hunter's sauce in 300 ml of water.",
        "In a pan, fry the chopped onion in margarine. After a while, add the previously boiled sauce and blueberries from the jar.",
        "If necessary, dilute the sauce with 2-3 tablespoons of water. Simmer everything for about 10 minutes.",
        "Fry the chops in a pan for 6-8 minutes on each side. Serve them on top of the blueberry sauce. They taste great, for example, with red cabbage."
      ],
      "ingredients": [
        "Pork chops (4 pieces).",
        "Lingonberry (200 grams).",
        "Hunting sauce (1 packet).",
        "Onions (1 piece).",
        "Marjoram.",
        "Mustard (1 tbsp.).",
        "Margarine (2 tablespoons).",
        "Oil (4 tablespoons)."
      ],
      "id": 19
    },
    {
      "name": "Traditional pork chop",
      "description": "Classic dish with pork chop, potatoes and salad",
      "steps": [
        "Cut the meat into slices about 1.5 cm. Beat with a pestle until about 3 mm thick. Beat the eggs lightly.",
        "Mix the breadcrumbs with the meat spice. Coat the cutlets in the egg, flour and bun.",
        "Fry in hot oil for 3-4 minutes on each side.",
        "Serve the pork chops with boiled potatoes and carrots with peas."
      ],
      "ingredients": [
        "Boneless pork loin (800 grams).",
        "Meat spice.",
        "Eggs (3 pieces).",
        "Breadcrumbs (200 grams).",
        "Flour (100 grams).",
        "Vegetable oil (2 tablespoons).",
        "Fresh dill (2 tablespoons)."
      ],
      "id": 20
    },
    {
      "name": "Vienna Schnitzel",
      "description": "Viennese schnitzel with potato salad",
      "steps": [
        "Wash the potatoes thoroughly and boil them in lightly salted water.",
        "When they are soft, drain the potatoes, add butter, vinegar, chopped chives and spice with dill and mix lightly.",
        "Break the meat with a pestle to the thinnest possible slice and season with meat seasoning.",
        "Then coat the meat in flour, beaten egg and breadcrumbs.",
        "Fry the cutlets in hot oil until the skin is crispy and brown. Then drain the excess fat on a paper towel.",
        "Serve the schnitzel with the previously prepared potatoes."
      ],
      "ingredients": [
        "Veal from the leg (400 grams).",
        "Young potatoes (400 grams).",
        "Meat spice.",
        "A mixture of herbs with dill.",
        "Breadcrumbs (half a glass).",
        "Flour (3 tablespoons).",
        "Vinegar (2 tablespoons).",
        "Chives (half a bunch).",
        "Eggs (2 pieces).",
        "Olive oil (2 tablespoons).",
        "Butter (1 tablespoon).",
        "Salt, frying oil."
      ],
      "id": 21
    },
    {
      "name": "Baked escalopes",
      "description": "Escalopes baked with mozzarella",
      "steps": [
        "Cook the pasta. Cut the tomatoes into quarters, remove the nests from them. Cut the mozzarella into slices.",
        "Clean the meat, cut into slices. Break the pieces of meat gently with a pestle, sprinkle with meat seasoning and fold. P",
        "Sprinkle the resulting escalopes with flour and fry them in a pan.",
        "Put the meat on a plate. Put a basil leaf, a quarter of a tomato, and a slice of cheese on each cutlet. Bake it in the oven for a while.",
        "In a pan, after frying the meat, fry the diced onion. Pour it all over with wine, cook until it completely unwraps.",
        "Pour in the cream, add the gravy and mix thoroughly. Boil the sauce for 2-3 minutes until it thickens.",
        "Serve the escalopes with the noodles fried in olive oil, with a generous sauce."
      ],
      "ingredients": [
        "Pork tenderloin (400 grams).",
        "Tomatoes, blanched without skin (2 pieces).",
        "Mozzarella cheese.",
        "Roast sauce (1 packet).",
        "Meat seasoning (1 packet).",
        "Onions (1 packet).",
        "Tagliatelle (200 grams).",
        "Sour cream (200 milliliters).",
        "White wine (100 milliliters).",
        "Flour (2 tablespoons).",
        "Olive oil (2 tablespoons).",
        "Basil (a few leaves)."
      ],
      "id": 22
    },
    {
      "name": "Pork tenderloin with sauce",
      "description": "Juicy pork tenderloin with cream and mayonnaise sauce",
      "steps": [
        "Clean the tenderloins of membranes and fat overgrowth. Cut into thick strips. Season the meat and fry it in a pan. Then put it aside.",
        "In the same pan, fry the sliced ​​onion and quartered mushrooms. Pour the cream all over.",
        "Cook for a while until the sauce starts to thicken. Add the meat again, bring it to a boil, set aside.",
        "Add the mayonnaise. Vigorously combine it with the remaining sauce, mixing thoroughly. Done!"
      ],
      "ingredients": [
        "Pork tenderloin (2 pieces).",
        "Mushrooms (500 grams).",
        "Onions (1 piece).",
        "Cream 18% (70 milliliters).",
        "Mayonnaise.",
        "Spices."
      ],
      "id": 23
    },
    {
      "name": "Potato Casserole with Chicken",
      "description": "Potato casserole with chicken and cheese",
      "steps": [
        "Cut the onion into feathers, fry it in a pot, add the diced chicken, fry for a while, add the sliced ​​potatoes.",
        "Fry it all, stirring from time to time, until the potatoes are slightly sticky.",
        "Then add the cream, bring it to a boil, then put it into an ovenproof dish, pressing all the ingredients together.",
        "Sprinkle the casserole on top with cheese, wrap in aluminum foil, and put in an oven preheated to 190 ° C for 40 minutes.",
        "Ten minutes before the end of baking, remove the foil so that the cheese can bake. Serve with chopped parsley."
      ],
      "ingredients": [
        "Chicken breast (400 grams).",
        "Potatoes (400 grams).",
        "Cream 18% (300 milliliters).",
        "Yellow cheese (100 grams).",
        "Oil (80 milliliters).",
        "Onions (1 piece).",
        "Parsley (1 bunch)."
      ],
      "id": 24
    },
    {
      "name": "Pasta in mushroom sauce",
      "description": "Delicious pasta in mushroom sauce",
      "steps": [
        "Dice the onion. Cut the chicken into strips and the mushrooms into slices.",
        "Cook the pasta according to the instructions on the package. Mix the milk and mustard.",
        "Fry the mushrooms in 1 tablespoon of oil. Return to a plate and then fry the onion separately. Add the chicken and fry until golden. Put the mushrooms into the pan.",
        "Combine it with the sauce. Cook for 5 minutes until it thickens a little.",
        "Serve the pasta sprinkled with chopped parsley."
      ],
      "ingredients": [
        "Chicken breast fillets (500 grams).",
        "Tagliatelle (250 grams)",
        "Mushrooms (500 grams).",
        "Milk (150 milliliters).",
        "Onions (1 piece).",
        "Mustard (2 tablespoons).",
        "Fresh parsley (half a bunch).",
        "Rapeseed oil (1 tbsp.)."
      ],
      "id": 25
    },
    {
      "name": "Oatmeal",
      "description": "The best porridge according to the recipe from Kwestia Smaku",
      "steps": [
        "Pour oatmeal into a pot and rinse it several times, changing the water. Drain, pour the milk, add a little salt and bring to the boil (you can also add raisins",
        "Reduce heat and cook until tender for about 15 minutes, stirring constantly. At the end, season with sugar and optionally vanilla sugar.",
        "Serve with your favorite toppings such as fruit, maple syrup or honey."
      ],
      "ingredients": [
        "1 cup of oatmeal (regular, mountain)",
        "3 glasses of milk",
        "3 tablespoons of sugar (or to taste)",
        "optional: 1 tbsp vanilla sugar, 1/3 glass"
      ],
      "id": 26
    },
    {
      "name": "Yoghurt pancakes with banana",
      "description": "Delicious banana fritters",
      "steps": [
        "Mix the yoghurt, eggs and vanilla sugar with a whisk, fork or mixer on a minimal wade.",
        "Sift the flour into another bowl, add baking powder to it and mix thoroughly.",
        "Pour into a bowl with wet ingredients and mix with a whisk or gently mix until the ingredients combine to a smooth and homogeneous mass without lumps",
        "Preheat a frying pan (e.g. a large pancake pan or another with a non-stick coating), apply 1 full tablespoon of dough per cake, keeping",
        "Fry over low heat until they are golden and nicely browned (about 3 minutes). You can fry without fat, but I add a small amount of mass",
        "About halfway or at the end of frying, before turning the pancakes over, press 3 banana slices into the raw dough",
        "Turn the pancakes over and fry until golden brown, for about 3 minutes over moderate heat. Before frying the next batch of pancakes,"
      ],
      "ingredients": [
        "250 g of natural yoghurt \n",
        "2 eggs \n",
        "1 tablespoon of vanilla (or regular) sugar",
        "170 g of wheat flour \n",
        "2 flat teaspoons of baking powder",
        "2 bananas \n"
      ],
      "id": 27
    },
    {
      "name": "Raspberry millet pudding",
      "description": "Filling pudding",
      "steps": [
        "Pour the millet into the strainer and rinse it under running water. Put it in a saucepan, pour the milk and bring to a boil, covered.",
        "Reduce heat to a minimum and cook for 15 minutes without opening the pot. \n",
        "Blend the cooked groats into a smooth mousse with the addition of (thawed) raspberries and raspberry syrup in a blender (standing, cup). J"
      ],
      "ingredients": [
        "1/2 cup of millet \n",
        "2 glasses of milk \n",
        "about 1/2 cup of raspberries (fresh or frozen)",
        "3 tablespoons of syrup / raspberry juice \n"
      ],
      "id": 28
    },
    {
      "name": "Croutons with avocado, cheese and pomegranate",
      "description": "Delicious toasts with sour pomegranate",
      "steps": [
        "The bread can be toasted in a toaster if you want it to be crispy. Peel the avocado, cut it into pieces and crush it a little with a fork.",
        "Season with salt, pepper and drizzle with olive oil.",
        "Put the paste on the bread. Crumble the cheese on top and sprinkle with pomegranate. Add the mint leaves and drizzle with extra oil."
      ],
      "ingredients": [
        "e.g. wholemeal bread \n",
        "1 avocado \n",
        "50 g of salad cheese or feta cheese",
        "1/4 pomegranate",
        "mint leaves",
        "extra oil, salt and pepper"
      ],
      "id": 29
    },
    {
      "name": "Vegetable medallions",
      "description": "Nutritious suggestion for breakfast",
      "steps": [
        "Put half of the broccoli on the boiling water (with the roses facing upwards). Boil for about 3 minutes, remove and cut into small pieces, cool.",
        "Time to cut lengthwise into 4 parts, rinse, dry, then chop. Put in a frying pan with oil and simmer for about 5 minutes until tender.",
        "Dice the boiled and peeled potatoes. Preheat the oven to 180 degrees C.",
        "In a bowl, beat the eggs with cream or milk, salt, pepper and oregano. Add the wheat and potato flour and mix thoroughly with a whisk.",
        "Combine with a spoon the dill or chives, diced cheese and prepared ingredients: broccoli, leek and potatoes.",
        "8 heat-resistant ramekins (or 8 cavities in a muffin mold or 8 silicone molds), grease with oil or butter, then fill with mass.",
        "Put in the oven and bake for 20 minutes."
      ],
      "ingredients": [
        "1/2 broccoli \n",
        "1/2 season \n",
        "1 tablespoon of olive oil \n",
        "2 - 3 boiled potatoes \n",
        "3 eggs \n",
        "3 tablespoons of 30% cream or milk \n",
        "salt, pepper, 1 teaspoon of dried oregano",
        "1 teaspoon of wheat and potato flour",
        "1 tablespoon of chopped dill or chives",
        "4 slices of yellow cheese \n"
      ],
      "id": 30
    },
    {
      "name": "Smoked fish paste",
      "description": "Smoked fish paste with egg, pickled cucumber and onion",
      "steps": [
        "Hard-boil the eggs and peel them. Chop them on a board and put them in a large bowl.",
        "Clean the fish of the bones and skin. Chop the selected pieces of meat on a board and add to the bowl with eggs.",
        "Add finely diced and glazed in oil onion and diced pickled cucumbers (if they have a hard skin, it's best to peel it",
        "Season with a teaspoon of freshly ground pepper, a pinch of salt and mix with mayonnaise, cream and chopped chives."
      ],
      "ingredients": [
        "4 eggs \n",
        "approx. 500 g of smoked cod or other white fish n",
        "1 onion \n",
        "1 tablespoon of oil / olive oil \n",
        "4 pickled cucumbers \n",
        "2 tablespoons of mayonnaise \n",
        "4 tablespoons of cream 18% \n",
        "bunch of chives \n"
      ],
      "id": 31
    },
    {
      "name": "Dutch baby with apples",
      "description": "Baked pancake with apples",
      "steps": [
        "Warm the eggs (e.g. put them in a pot with warm water) or take them out of the fridge beforehand. Gently warm the milk or warm it to room temperature. \n",
        "Preheat the oven to 220 degrees C, also heat a casserole dish or a heat-resistant pan in the middle of the oven.",
        "Clarify 4 tablespoons of butter (heat it in a saucepan, collect and remove the foam). Peel the apple, cut into 8-10 pieces (slices). \n",
        "Put eggs into a blender (standing, with a glass), add milk, flour, vanilla sugar and salt.",
        "Briefly mix the mixture of ingredients from the blender (4 seconds) to a homogeneous mass.",
        "Remove the rack with the hot dish from the oven, add 2 tablespoons of clarified butter, then slowly pour the mixed ingredients onto the omelette.",
        "Break apart the apple pieces and close the oven. \n",
        "Bake uncovered for about 20 minutes, until the omelette grows in places and is well browned and crispy.",
        "Remove from oven, sprinkle with cinnamon. Serve with the rest of the clarified butter and powdered sugar."
      ],
      "ingredients": [
        "3 eggs \n",
        "1/2 cup of milk (125 ml) \n",
        "1/2 cup of wheat flour \n",
        "1 teaspoon of vanilla sugar \n",
        "a little pinch of salt \n",
        "butter \n",
        "1 apple (e.g. reneta) \n",
        "pinch of cinnamon \n",
        "powdered sugar \n"
      ],
      "id": 32
    },
    {
      "name": "Rice pudding with pears",
      "description": "Pudding with caramelized pears",
      "steps": [
        "Pour rice into a medium pot, pour in milk, add butter, salt and raisins. Mix and boil it, stirring constantly.",
        "Then cook uncovered for about 18 minutes, stirring constantly, until the rice is soft.",
        "Season with vanilla sugar at the end. Over time (with longer cooking or cooling down) the pudding will thicken more. \n",
        "Peel the pears, carve out the seed nests, cut into cubes, sprinkle with lemon juice, mix, put away.",
        "Pour sugar into a saucepan with a thick bottom, spread it on the bottom, and heat it over medium heat for about 2-3 minutes.",
        "Pour the pears with juice (attention, it will splash) and mix the ingredients by shaking the pot.",
        "Put it back on the fire and cook for about 2-3 minutes until the pears are tender, partially disintegrated and a thick caramel syrup is formed."
      ],
      "ingredients": [
        "1/2 cup (100 g) of rice",
        "2 and 1/2 cups of milk \n",
        "1/2 tablespoon of butter \n",
        "a little pinch of salt \n",
        "2 tablespoons of raisins \n",
        "16 g (1 pack) of vanilla sugar \n",
        "2 pears \n",
        "1 tablespoon of lemon juice \n",
        "3 tablespoons of sugar \n"
      ],
      "id": 33
    },
    {
      "name": "Hummus",
      "description": "Chickpea and tahini paste",
      "steps": [
        "Place the drained chickpeas in the container of the melaster, chopper or blender.",
        "Add a few tablespoons of chickpea pickle or water and start mixing it into a paste. \n",
        "In the meantime, add the rest of the ingredients",
        "While mixing, gradually add more of the pickle to get the consistency of the paste."
      ],
      "ingredients": [
        "1 can of approx. 400 g of chickpeas * \n",
        "1 teaspoon of lemon juice \n",
        "1 small clove of garlic \n",
        "5 tablespoons of tahini sesame paste",
        "1 teaspoon of ground cumin (Roman cumin) \n",
        "salt and pepper \n",
        "1 tablespoon of sesame oil or extra virgin olive oil \n"
      ],
      "id": 34
    },
    {
      "name": "Bean soup",
      "description": "Broad bean soup",
      "steps": [
        "Boil the broad beans in salted water, strain and measure the required amount. Peel.",
        "Clean the leeks of the outer leaves, leave the white and light green part, rinse thoroughly between the layers, cut into slices.",
        "Melt the butter in a pot, add the peeled and diced onion, stir and fry.",
        "Add chopped leeks and after a while peeled and diced potatoes. Fry for about 3 minutes, stirring every now and then, until the vegetables are soft.",
        "Increase the heat, add the water or broth and bring to the boil. Season with salt, reduce the heat, cover and cook the vegetables until soft for about 15 minutes.",
        "5 minutes before the end, add 400 g of cooked and peeled broad beans (keep the rest whole). \n",
        "Add extra virgin olive oil, milk and blend until smooth."
      ],
      "ingredients": [
        "500 g of cooked broad beans \n",
        "2 seasons \n",
        "20 g butter (or coconut oil) \n",
        "1 onion \n",
        "250 g potatoes \n",
        "1 liter of broth or water \n",
        "1 tablespoon of extra virgin olive oil \n",
        "1/2 cup of milk (cow or almond) \n",
        "1 tablespoon of chopped parsley \n"
      ],
      "id": 35
    },
    {
      "name": "Fish soup",
      "description": "Delicious soup with pieces of fish",
      "steps": [
        "Wash the vegetables. Peel the carrots, parsley and celery and grate them on a larger mesh grater. It's time to cut lengthwise into 4 parts.",
        "Cut the onion into cubes.",
        "In a wider pot, glaze the onion on a spoonful of olive oil and a spoon of butter. Then add the leek and continue to fry, stirring every now and then, for about 2 minutes. \n",
        "Add carrots, parsley and celery. Season vegetables with salt and pepper and fry for about 3 minutes. Add spices and mix.",
        "Pour in hot broth and bring to boil. Add tomato puree and tomatoes.",
        "After boiling, cover the soup, reduce the heat and cook for about 10 minutes until the vegetables are tender. \n",
        "Rinse the fish, cut off the skin and remove the bones. Dice it, season with salt and put it in the milk. Then roll in flour and fry briefly in a pan.",
        "Put the fried fish into the pot with the soup and cook for about 2 - 3 minutes."
      ],
      "ingredients": [
        "500 g of fresh fish fillets",
        "1 and 1/2 liters of vegetable broth \n",
        "1/2 onion, 1 carrot, 1 little parsley",
        "1 fresh tomato",
        "1 teaspoon of tomato paste",
        "1 tablespoon of oil and 1 tablespoon of butter \n",
        "2 tablespoons of wheat flour \n",
        "a few tablespoons of milk \n"
      ],
      "id": 36
    },
    {
      "name": "Red Lentil Soup",
      "description": "Filling soup for autumn days",
      "steps": [
        "Dice the onion and fry in butter.",
        "Add the chopped vegetables.",
        "Pour the broth.",
        "Boil vegetables and lentils until soft.",
        "Season with curry, salt and pepper."
      ],
      "ingredients": [
        "200g of red lentils",
        "1l of vegetable broth",
        "1 teaspoon of curry",
        "Salt and pepper",
        "1 carrot, parsley root, celery and 0.5 leek"
      ],
      "id": 37
    },
    {
      "name": "Instant sour soup",
      "description": "Żurek like at grandma's",
      "steps": [
        "Boil the broth with the smoked meat in a pot. Cover and simmer for about 30 minutes.",
        "Add the sour soup from the bottle (shake the bottle beforehand to mix the contents) and the cream and marjoram. Mix thoroughly.",
        "Season with ground pepper if necessary and add the peeled and chopped sausage. Heat and serve with additions. \n"
      ],
      "ingredients": [
        "250 g of smoked bacon",
        "2 liters of broth",
        "500 ml of soup - sourdough (ready, from a bottle)",
        "200 ml of 18% thick homogenized cream",
        "1 tablespoon of dried marjoram",
        "350 g country sausage \n"
      ],
      "id": 38
    },
    {
      "name": "Curry soup with courgette",
      "description": "Oriental soup",
      "steps": [
        "Fry the diced onion in a wide pot in oil. Add finely grated ginger and garlic. Stir and fry for a while.",
        "Add peeled and grated carrots and, stirring every now and then, fry for about 2 minutes. Add chopped paprika and diced zucchini in a moment.",
        "Stirring every now and then, fry for about 5 minutes, in the meantime add the curry paste.",
        "Pour the broth and bring to a boil. Cook under the lid open for about 8 minutes until the vegetables are tender, meanwhile adding the peeled and chopped tomato.",
        "Mix by adding 2 tablespoons of coconut milk or cream."
      ],
      "ingredients": [
        "1 tablespoon of vegetable oil, for example coconut",
        "1 onion \n",
        "2 cm piece of ginger \n",
        "1 clove of garlic \n",
        "1 clove of garlic \n",
        "1/2 red pepper \n",
        "300 g zucchini \n",
        "1/2 teaspoon red curry paste (or a pinch of p",
        "500 ml of chicken or vegetable stock \n",
        "1 tomato \n",
        "about 1/3 cup of coconut milk or cream 30"
      ],
      "id": 39
    },
    {
      "name": "Chłodnik",
      "description": "Szybki chłodnik na kefirze z ogórkiem, rzodkiewką i sałatą.",
      "steps": [
        "Warzywa umyć i osuszyć. Ogórki obrać ze skórki i zetrzeć na tarce o większych oczkach. Rzodkiewki tak samo zetrzeć. Włożyć do miski.",
        "Dodać drobo poszatkowane liście sałaty, szczypiorek, koperek oraz obrany i przeciśnięty przez praskę lub drobno starty czosnek.",
        "Dodać kefir, doprawić solą oraz pieprzem i wymieszać. Schłodzić w lodówce."
      ],
      "ingredients": [
        "2 mniejsze ogórki gruntowe\n",
        "4 rzodkiewki\n",
        "2 liście sałaty\n",
        "3 łyżki posiekanego szczypiorku\n",
        "2 łyżki posiekanego koperku\n",
        "1 mały ząbek czosnku\n",
        "500 ml kefiru (schłodzony)\n",
        "sól i pieprz\n"
      ],
      "id": 40
    }
  ],
  "schedules": [
    {
      "name": "Vegetarian plan",
      "description": "A healthy, balanced week of eating without meat.",
      "weekNumber": "1",
      "monday": [
        "Raspberry millet pudding",
        "Porridge",
        "Fish soup",
        "Cauliflower and millet cutlets",
        "Hummus"
      ],
      "tuesday": [
        "Smoked fish paste",
        "Hummus",
        "Bean soup",
        "Salmon baked in honey sauce",
        "Rice with vegetables"
      ],
      "wednesday": [
        "Yoghurt pancakes with banana",
        "Rice pudding with pears",
        "Red lentil soup",
        "Cauliflower and millet cutlets",
        "Dutch baby with apples"
      ],
      "thursday": [
        "Croutons with avocado, cheese and avocado",
        "Raspberry millet pudding",
        "Bean soup",
        "Pasta in mushroom sauce",
        "Smoked fish paste"
      ],
      "friday": [
        "Vegetable medallions",
        "Red lentil soup",
        "Fish soup",
        "Rice with vegetables",
        "Rice pudding with pears"
      ],
      "saturday": [
        "Hummus",
        "Croutons with avocado, cheese and avocado",
        "Red lentil soup",
        "Pasta in mushroom sauce",
        "Fish soup"
      ],
      "sunday": [
        "Dutch baby with apples",
        "Hummus",
        "Potato soup",
        "Zander with stewed vegetables",
        "Vegetable medallions"
      ],
      "id": 1
    },
    {
      "name": "Meat plan",
      "description": "Meat is a great source of valuable protein and iron. It is worth eating it.",
      "weekNumber": "2",
      "monday": [
        "Hummus",
        "Smoked fish paste",
        "Potato soup",
        "Risotto with chicken and mushrooms",
        "Mexican stuffed cabbage"
      ],
      "tuesday": [
        "Vegetable medallions",
        "Stuffed minced cutlets with mushrooms and cheese",
        "Soup with cream served cold",
        "Chicken rolls with spinach",
        "Dutch baby with apples"
      ],
      "wednesday": [
        "Porridge",
        "Yoghurt pancakes with banana",
        "Curry soup with zucchini",
        "Beefsteak with vegetables",
        "Rice with vegetables"
      ],
      "thursday": [
        "Croutons with avocado, cheese and pomegranate",
        "Dutch baby with apples",
        "Red lentil soup",
        "Baked escalopes",
        "Risotto with chicken and mushrooms"
      ],
      "friday": [
        "Smoked fish paste",
        "Rice pudding with pears",
        "Cabbage soup with bacon and sausage",
        "Chicken rolls with spinach",
        "Bolognese rolls"
      ],
      "saturday": [
        "Raspberry millet pudding",
        "Hummus",
        "Instant sour rye soup",
        "Risotto with chicken",
        "Salmon baked in honey sauce"
      ],
      "sunday": [
        "Porridge",
        "Soup with cream served cold",
        "Cabbage soup with bacon and sausage",
        "Viennese schnitzel",
        "Rice with vegetables and meat"
      ],
      "id": 2
    },
    {
      "name": "Daily schedule",
      "description": "",
      "weekNumber": "5",
      "monday": [
        "Porridge",
        "Croutons with avocado, cheese and pomegranate",
        "Bean soup",
        "Mexican chicken",
        "Smoked fish paste"
      ],
      "tuesday": [
        "Porridge",
        "Croutons with avocado, cheese and pomegranate",
        "Instant sour rye soup",
        "Bolognese rolls",
        "Vegetable medallions"
      ],
      "wednesday": [
        "Porridge",
        "Smoked fish paste",
        "Red lentil soup",
        "Pasta in mushroom sauce",
        "Zander with stewed vegetables"
      ],
      "thursday": [
        "Porridge",
        "Rice pudding with pears",
        "Cabbage soup with bacon and sausage",
        "Cauliflower and millet cutlets",
        "Chicken rolls with spinach"
      ],
      "friday": [
        "Porridge",
        "Dutch baby with apples",
        "Potato soup",
        "Potato casserole with chicken",
        "Potato Casserole with Chicken"
      ],
      "saturday": [
        "Yoghurt pancakes with banana",
        "Dutch baby with apples",
        "Curry soup with zucchini",
        "Stuffed minced cutlets with mushrooms and cheese",
        "Gołąbki a Mexican style"
      ],
      "sunday": [
        "Raspberry millet pudding",
        "Rice pudding with pears",
        "Chicken broth",
        "Pork loin with blueberries",
        "Chicken broth"
      ],
      "id": 3
    },
    {
      "name": "Schedule for the current week",
      "description": "",
      "weekNumber": "27",
      "monday": [
        "Rice with vegetables",
        "Red lentil soup",
        "Curry soup with zucchini",
        "Rice with vegetables",
        "Risotto with chicken"
      ],
      "tuesday": [
        "Risotto with chicken",
        "Instant sour rye soup",
        "Curry soup with zucchini",
        "Mexican chicken",
        "Rice with vegetables and meat"
      ],
      "wednesday": [
        "Gołąbki a Mexican style",
        "Risotto with chicken and mushrooms",
        "Instant sour rye soup",
        "Viennese schnitzel",
        "Bean soup"
      ],
      "thursday": [
        "Chicken rolls with spinach",
        "Soup with cream served cold",
        "Potato soup",
        "Baked escalopes",
        "Risotto with chicken and mushrooms"
      ],
      "friday": [
        "Mexican chicken",
        "Cauliflower and millet cutlets",
        "Cabbage soup with bacon and sausage",
        "Rice with vegetables",
        "Mexican chicken"
      ],
      "saturday": [
        "Rice with vegetables",
        "Yoghurt pancakes with banana",
        "Fish soup",
        "Rice with vegetables and meat",
        "Croutons with avocado, cheese and pomegranate"
      ],
      "sunday": [
        "Hummus",
        "Zander with stewed vegetables",
        "Chicken broth",
        "Stuffed minced cutlets with mushrooms and cheese",
        "Vegetable medallions"
      ],
      "id": 4
    },
    {
      "name": "Alternative plan",
      "description": "",
      "weekNumber": "50",
      "monday": [
        "Salmon baked in honey sauce",
        "Potato soup",
        "Bean soup",
        "Stuffed minced cutlets with mushrooms and cheese",
        "Beefsteak with vegetables"
      ],
      "tuesday": [
        "Stuffed minced cutlets with mushrooms and cheese",
        "Zander with stewed vegetables",
        "Instant sour rye soup",
        "Stuffed minced cutlets with mushrooms and cheese",
        "Dutch baby with apples"
      ],
      "wednesday": [
        "Beef steak with vegetables",
        "Roast Pork",
        "Instant sour rye soup",
        "Risotto with chicken and mushrooms",
        "Gołąbki a Mexican style"
      ],
      "thursday": [
        "Rice pudding with pears",
        "Risotto with chicken",
        "Fish soup",
        "Risotto with chicken",
        "Salmon baked in honey sauce"
      ],
      "friday": [
        "Hummus",
        "Rice with vegetables and meat",
        "Soup with cream served cold",
        "Viennese schnitzel",
        "Fish soup"
      ],
      "saturday": [
        "Bean soup",
        "Rice with vegetables and meat",
        "Chicken broth",
        "Smoked fish paste",
        "Bean soup"
      ],
      "sunday": [
        "Hummus",
        "Raspberry millet pudding",
        "Chicken broth",
        "Cabbage soup with bacon and sausage",
        "Dutch baby with apples"
      ],
      "id": 5
    }
  ]
}
